src/main/resources/examples/print_ticket_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://mulesoft.org/orderManagement-service">
   <soapenv:Header>
      <ord:AuthenticationHeader>
         <apiKey>?</apiKey>
      </ord:AuthenticationHeader>
   </soapenv:Header>
   <soapenv:Body>
      <ord:TrackStatus>
         <email>?</email>
         <orderId>?</orderId>
      </ord:TrackStatus>
   </soapenv:Body>
</soapenv:Envelope>